In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=["A","B","C"], index=["x","y","z"])

In [3]:
df

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [4]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [5]:

df.index.tolist()

['x', 'y', 'z']

In [6]:
df.index

Index(['x', 'y', 'z'], dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [8]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [9]:
df.size

9

In [10]:
df.shape

(3, 3)

In [11]:
df.head()

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [12]:
df.tail(2)

   A  B  C
y  4  5  6
z  7  8  9

In [13]:
df.nunique()

A    3
B    3
C    3
dtype: int64

In [14]:
df["B"].nunique

<bound method IndexOpsMixin.nunique of x    2
y    5
z    8
Name: B, dtype: int64>

Loading Datasets

In [15]:
coffee=pd.read_csv('./warmup-data/coffee.csv')

In [16]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [17]:
results=pd.read_csv('./data/results.csv')

In [18]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [19]:
noc_regions=pd.read_csv('./data/noc_regions.csv')

In [20]:
olympics_data = pd.read_excel('./data/olympics-data.xlsx',sheet_name='results')

In [21]:
olympics_data.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [22]:
bios=pd.read_csv('./data/bios.csv')

In [23]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

#

Accessing Dataset

In [24]:
bios.to_csv

<bound method NDFrame.to_csv of         athlete_id                   name   born_date        born_city  \
0                1  Jean-François Blanchy  1886-12-12         Bordeaux
1                2         Arnaud Boetsch  1969-04-01           Meulan
2                3           Jean Borotra  1898-08-13         Biarritz
3                4        Jacques Brugnon  1895-05-11      Paris VIIIe
4                5           Albert Canet  1878-04-17       Wandsworth
...            ...                    ...         ...              ...
145495      149222      Polina Luchnikova  2002-01-30            Serov
145496      149223    Valeriya Merkusheva  1999-09-20  Moskva (Moscow)
145497      149224        Yuliya Smirnova  1998-05-08           Kotlas
145498      149225         André Foussard  1899-05-19            Niort
145499      149814          Bill Phillips  1913-07-15     Dulwich Hill

                 born_region born_country        NOC  height_cm  weight_kg  \
0                    Gironde          FRA     France        NaN        NaN
1                   Yvelines          FRA     France      183.0       76.0
2       Pyrénées-Atlantiques          FRA     France      183.0       76.0
3                      Paris          FRA     France      168.0       64.0
4                    England          GBR     France        NaN        NaN
...                      ...          ...        ...        ...        ...
145495            Sverdlovsk          RUS        ROC      167.0       61.0
145496                Moskva          RUS        ROC      168.0       65.0
145497           Arkhangelsk          RUS        ROC      163.0       55.0
145498           Deux-Sèvres          FRA     France      166.0        NaN
145499       New South Wales          AUS  Australia        NaN        NaN

         died_date
0       1960-10-02
1              NaN
2       1994-07-17
3       1978-03-20
4       1930-07-25
...            ...
145495         NaN
145496         NaN
145497         NaN
145498  1986-03-18
145499  2003-10-20

[145500 rows x 10 columns]>

In [25]:
coffee=pd.read_csv('./warmup-data/coffee.csv')

In [26]:
display(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [27]:
coffee.head(6)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25

In [28]:
coffee.tail(5)

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [29]:
coffee.sample(3)

        Day Coffee Type  Units Sold
8    Friday    Espresso          45
3   Tuesday       Latte          20
6  Thursday    Espresso          40

In [30]:
coffee.loc[:3]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30
3  Tuesday       Latte          20

In [31]:
coffee.loc[3:]

          Day Coffee Type  Units Sold
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [32]:
coffee.loc[0:4,["Day","Units Sold"]]

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

In [33]:
coffee.iloc[0:5,[1,2]]

  Coffee Type  Units Sold
0    Espresso          25
1       Latte          15
2    Espresso          30
3       Latte          20
4    Espresso          35

In [34]:
coffee.index=coffee["Day"]

In [35]:
coffee.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35

In [36]:
coffee=pd.read_csv('./warmup-data/coffee.csv')

In [37]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [38]:
coffee.loc[2:4,["Units Sold"]]=10

In [39]:
coffee.head(5)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          10
3    Tuesday       Latte          10
4  Wednesday    Espresso          10

In [128]:
coffee.at[2,"Units Sold"]

np.float64(34.166666666666664)

In [129]:
coffee.at[2,"Coffee Type"]

'Espresso'

In [130]:
coffee.iat[3,2]

np.float64(34.166666666666664)

In [43]:
coffee.iat[3,1]

'Latte'

In [44]:
coffee.iat[4,1]

'Espresso'

In [45]:
coffee.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [46]:
coffee["Day"]

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [47]:
coffee.sort_values(["Units Sold"], ascending=True)

          Day Coffee Type  Units Sold
3     Tuesday       Latte          10
2     Tuesday    Espresso          10
4   Wednesday    Espresso          10
1      Monday       Latte          15
0      Monday    Espresso          25
5   Wednesday       Latte          25
7    Thursday       Latte          30
9      Friday       Latte          35
13     Sunday       Latte          35
11   Saturday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [48]:
coffee.sort_values(["Units Sold"], ascending=False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
7    Thursday       Latte          30
5   Wednesday       Latte          25
0      Monday    Espresso          25
1      Monday       Latte          15
4   Wednesday    Espresso          10
2     Tuesday    Espresso          10
3     Tuesday       Latte          10

In [49]:
for index, row in coffee.iterrows():
    print(index)
    print(row)
    print("Name of coffee type:" ,row["Coffee Type"])

0
Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object
Name of coffee type: Espresso
1
Day            Monday
Coffee Type     Latte
Units Sold         15
Name: 1, dtype: object
Name of coffee type: Latte
2
Day             Tuesday
Coffee Type    Espresso
Units Sold           10
Name: 2, dtype: object
Name of coffee type: Espresso
3
Day            Tuesday
Coffee Type      Latte
Units Sold          10
Name: 3, dtype: object
Name of coffee type: Latte
4
Day            Wednesday
Coffee Type     Espresso
Units Sold            10
Name: 4, dtype: object
Name of coffee type: Espresso
5
Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object
Name of coffee type: Latte
6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object
Name of coffee type: Espresso
7
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object
Name of coffee type: Latte
8
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object
Name of coffee type: Espresso
9
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object
Name of coffee type: Latte
10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object
Name of coffee type: Espresso
11
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object
Name of coffee type: Latte
12
Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object
Name of coffee type: Espresso
13
Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object
Name of coffee type: Latte

Filtering Data

In [50]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [51]:
bios.loc[bios["weight_kg"]<50]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
338,339,Sonam Chuki,1963-04-07,NaN,NaN,NaN,Bhutan,163.0,48.0,NaN
532,534,Pat Conway,1944-01-16,Birmingham,England,GBR,Great Britain,167.0,44.0,NaN
537,539,Rachel Fenwick,1935-10-25,NaN,NaN,NaN,Great Britain,165.0,49.0,NaN
596,598,Chan Siu Yuk,1955-12-21,NaN,NaN,NaN,"Hong Kong, China",152.0,47.0,NaN
599,601,Wong-Lau So Han,1946-04-25,NaN,NaN,NaN,"Hong Kong, China",152.0,45.0,NaN
...,...,...,...,...,...,...,...,...,...,...
142409,146016,Catarina Costa,1996-09-21,Coimbra,Distrito de Coimbra,POR,Portugal,154.0,48.0,NaN
143650,147304,Jourdan Delacruz,1998-05-20,Dallas,Texas,USA,United States,150.0,49.0,NaN
144061,147727,Francisca Mardones,1989-03-24,Santiago,Santiago Metropolitan,CHI,Chile,150.0,48.0,NaN
144193,147874,Eva Pinkelnig,1988-05-27,Bregenz,Vorarlberg,AUT,Austria,159.0,46.0,NaN
144753,148454,Ioulia Chtchetinina,1995-12-24,Nizhny Novgorod,Nizhny Novgorod,RUS,Hungary,158.0,45.0,NaN

In [52]:
bios.loc[bios["height_cm"]>200, ["name", "height_cm"]]

                      name  height_cm
1080        Bozhil Lozanov      208.0
1673      Alexis Rubalcaba      204.0
2647         Milan Šrejber      203.0
2827    Nik'oloz Deriugini      206.0
2832         Elşad Qadaşev      205.0
...                    ...        ...
143784  Daniel Miklasevich      203.0
143833  Garrett Muagututia      205.0
143834         Kyle Ensing      201.0
143835         Mitch Stahl      203.0
143919   Emerson Rodríguez      204.0

[1219 rows x 2 columns]

In [53]:
bios[bios["height_cm"]> 200][["name", "height_cm"]]

                      name  height_cm
1080        Bozhil Lozanov      208.0
1673      Alexis Rubalcaba      204.0
2647         Milan Šrejber      203.0
2827    Nik'oloz Deriugini      206.0
2832         Elşad Qadaşev      205.0
...                    ...        ...
143784  Daniel Miklasevich      203.0
143833  Garrett Muagututia      205.0
143834         Kyle Ensing      201.0
143835         Mitch Stahl      203.0
143919   Emerson Rodríguez      204.0

[1219 rows x 2 columns]

In [54]:
bios[(bios['height_cm']<158) & (bios['born_country']=='USA')] [["name","height_cm"]]

                    name  height_cm
2208    Melanie Skillman      155.0
8577         Bill Bossio      155.0
8605      Frankie Genaro      156.0
8625      Maurice Frilot      150.0
8700           Ray Perez      155.0
...                  ...        ...
143538        Jade Carey      157.0
143539     Jordan Chiles      150.0
143540   MyKayla Skinner      152.0
143544    Sakura Kokumai      152.0
143650  Jourdan Delacruz      150.0

[270 rows x 2 columns]

In [132]:
bios[bios['name'].str.contains('sam' ,case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category,born_year,born_month,height_rank
33,34,Jean-Pierre Samazeuilh,1891-01-17,Bordeaux,Gironde,FRA,France,NaN,NaN,1965-04-13,tall,Heavyweight,1891.0,1.0,NaN
68,69,Sam Smith,1971-11-27,Epping,England,GBR,Great Britain,175.0,62.0,NaN,average,Middleweight,1971.0,11.0,58380.5
690,693,Uladzimir Samsonau,1976-04-17,Minsk,Minsk,BLR,Belarus,189.0,83.0,NaN,tall,Heavyweight,1976.0,4.0,11668.0
1123,1130,Ek Sam An,1944-01-16,NaN,NaN,NaN,Cambodia,163.0,54.0,NaN,short,Lightweight,1944.0,1.0,96305.5
1223,1230,Samuel Rennie,1903-07-18,Montréal,Québec,CAN,Canada,NaN,NaN,1952-02-28,tall,Heavyweight,1903.0,7.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145121,148837,Aleksandr Samonov,1995-08-23,Moskva (Moscow),Moskva,RUS,ROC,NaN,NaN,NaN,tall,Heavyweight,1995.0,8.0,NaN
145132,148848,Samir Mastiyev,1993-01-13,Yekaterinburg,Sverdlovsk,RUS,ROC,NaN,NaN,NaN,tall,Heavyweight,1993.0,1.0,NaN
145254,148974,Samuel Kňažko,2002-08-07,Trenčín,Trenčín,SVK,Slovakia,185.0,86.0,NaN,tall,Heavyweight,2002.0,8.0,21202.5
145260,148980,Samuel Takáč,1991-12-03,Poprad,Prešov,SVK,Slovakia,184.0,92.0,NaN,average,Heavyweight,1991.0,12.0,24214.0
145409,149132,Sam Hentges,1999-07-26,New Brighton,Minnesota,USA,United States,NaN,NaN,NaN,tall,Heavyweight,1999.0,7.0,NaN

In [56]:
bios[bios['name'].str.contains("altman",case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
13285,13365,Virgilius Altmann,1913-02-09,Wien (Vienna),Wien,AUT,Austria,NaN,NaN,1943-10-17
116682,118090,Mike Altman,1975-08-21,Los Angeles,California,USA,United States,183.0,73.0,NaN
125005,127348,Mario Altmann,1986-11-04,Wien (Vienna),Wien,AUT,Austria,193.0,98.0,NaN
126153,128503,Livia Altmann,1994-12-13,Glarus Süd,Glarus,SUI,Switzerland,165.0,64.0,NaN

In [57]:
bios[bios['name'].str.contains('sam|patrick', case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN
33,34,Jean-Pierre Samazeuilh,1891-01-17,Bordeaux,Gironde,FRA,France,NaN,NaN,1965-04-13
68,69,Sam Smith,1971-11-27,Epping,England,GBR,Great Britain,175.0,62.0,NaN
119,120,Patrick Wheatley,1899-01-20,Vryheid,KwaZulu-Natal,RSA,Great Britain,NaN,NaN,1967-11-05
319,320,Patrick De Koning,1961-04-23,Dendermonde,Oost-Vlaanderen,BEL,Belgium,178.0,92.0,NaN
...,...,...,...,...,...,...,...,...,...,...
145132,148848,Samir Mastiyev,1993-01-13,Yekaterinburg,Sverdlovsk,RUS,ROC,NaN,NaN,NaN
145254,148974,Samuel Kňažko,2002-08-07,Trenčín,Trenčín,SVK,Slovakia,185.0,86.0,NaN
145260,148980,Samuel Takáč,1991-12-03,Poprad,Prešov,SVK,Slovakia,184.0,92.0,NaN
145409,149132,Sam Hentges,1999-07-26,New Brighton,Minnesota,USA,United States,NaN,NaN,NaN
145435,149158,Patrick Gasienica,1998-11-28,McHenry,Illinois,USA,United States,NaN,NaN,2023-06-12

In [58]:
bios[bios['born_country'].isin(["USA","RSA","GBR"]) & (bios['name'].str.startswith("patrick"))]

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date]
Index: []

In [133]:
bios[bios['born_country'].isin(['USA',"GBR"]) & (bios['name'].str.startswith('Patrick'))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category,born_year,born_month,height_rank
18585,18712,Patrick Austen,1933-03-18,Kingston-upon-Thames,England,GBR,Great Britain,NaN,NaN,2013-10-14,tall,Heavyweight,1933.0,3.0,NaN
32759,33005,Patrick O'Neill,1956-03-20,Stamford,Connecticut,USA,United States,198.0,95.0,NaN,tall,Heavyweight,1956.0,3.0,2110.5
34513,34782,Patrick Harvey,1935-11-28,Guildford,England,GBR,Great Britain,170.0,63.0,NaN,average,Lightweight,1935.0,11.0,77037.5
35830,36114,Patrick Croskerry,1942-10-07,Dover,England,GBR,Canada,198.0,90.0,NaN,tall,Heavyweight,1942.0,10.0,2110.5
36989,37284,Patrick Delafield,1946-04-14,Petersfield,England,GBR,Great Britain,188.0,94.0,NaN,tall,Heavyweight,1946.0,4.0,13590.5
37188,37484,Patrick Sweeney,1952-08-12,London,England,GBR,Great Britain,157.0,50.0,NaN,short,Lightweight,1952.0,8.0,103650.5
37223,37519,Patrick Wright,1945-05-20,Nottingham,England,GBR,Great Britain,188.0,92.0,NaN,tall,Heavyweight,1945.0,5.0,13590.5
51061,51420,Patrick Jeffrey,1965-06-24,Madison,New Jersey,USA,United States,168.0,68.0,NaN,average,Lightweight,1965.0,6.0,83975.0
62910,63378,Patrick Pym,1936-09-06,Honiton,England,GBR,Great Britain,182.0,86.0,2019-12-04,average,Heavyweight,1936.0,9.0,31471.5
86494,87184,Patrick Howdle,1963-04-24,Driffield,England,GBR,Great Britain,NaN,NaN,NaN,tall,Heavyweight,1963.0,4.0,NaN
98204,98997,Patrick Winterton,1961-09-15,Aldershot,England,GBR,Great Britain,183.0,73.0,NaN,average,Middleweight,1961.0,9.0,27597.5
98696,99492,Patrick-Paul Schwarzacher-Joyce,1972-07-05,London,England,GBR,Ireland,188.0,80.0,NaN,tall,Heavyweight,1972.0,7.0,13590.5
117509,119009,Patrick Deneen,1987-12-25,Redmond,Washington,USA,United States,170.0,82.0,NaN,average,Heavyweight,1987.0,12.0,77037.5
117801,119335,Patrick Kane,1988-11-19,Buffalo,New York,USA,United States,180.0,82.0,NaN,average,Heavyweight,1988.0,11.0,38677.0
126431,128785,Patrick Meek,1985-11-10,Evanston,Illinois,USA,United States,175.0,71.0,NaN,average,Middleweight,1985.0,11.0,58380.5
131192,133959,Patrick Huston,1996-01-05,Belfast,Northern Ireland,GBR,Great Britain,183.0,84.0,NaN,average,Heavyweight,1996.0,1.0,27597.5
133368,136307,Patrick Reed,1990-08-05,San Antonio,Texas,USA,United States,183.0,91.0,NaN,average,Heavyweight,1990.0,8.0,27597.5
135130,138272,Patrick Caldwell,1994-02-18,Lebanon,New Hampshire,USA,United States,183.0,77.0,NaN,average,Middleweight,1994.0,2.0,27597.5
143735,147390,Patrick Kivlehan,1989-12-22,Nyack,New York,USA,United States,188.0,NaN,NaN,tall,Heavyweight,1989.0,12.0,13590.5
143797,147453,Patrick Sunderman,1994-08-17,Farmington,Minnesota,USA,United States,183.0,NaN,NaN,average,Heavyweight,1994.0,8.0,27597.5
145435,149158,Patrick Gasienica,1998-11-28,McHenry,Illinois,USA,United States,NaN,NaN,2023-06-12,tall,Heavyweight,1998.0,11.0,NaN

In [60]:
bios.query('born_country=="USA" and born_city=="Seattle"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
11030,11088,David Halpern,1955-08-18,Seattle,Washington,USA,United States,178.0,79.0,NaN
12800,12870,Todd Trewin,1958-04-20,Seattle,Washington,USA,United States,180.0,75.0,NaN
15476,15583,Scott McKinley,1968-10-15,Seattle,Washington,USA,United States,183.0,75.0,NaN
29079,29293,Joyce Tanac,1950-09-27,Seattle,Washington,USA,United States,156.0,49.0,NaN
31135,31371,Bill Kuhlemeier,1908-01-14,Seattle,Washington,USA,United States,NaN,NaN,2001-07-08
...,...,...,...,...,...,...,...,...,...,...
133392,136331,Hans Struzyna,1989-03-31,Seattle,Washington,USA,United States,188.0,91.0,NaN
135448,138662,Maude Davis Crossland,2003-03-19,Seattle,Washington,USA,Colombia,NaN,NaN,NaN
136993,140229,Jenell Berhorst,2003-12-13,Seattle,Washington,USA,United States,NaN,NaN,NaN
143507,147159,Nevin Harrison,2002-06-02,Seattle,Washington,USA,United States,175.0,73.0,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN

Add a new column

In [61]:
coffee['price']=5

In [62]:
coffee

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25      5
1      Monday       Latte          15      5
2     Tuesday    Espresso          10      5
3     Tuesday       Latte          10      5
4   Wednesday    Espresso          10      5
5   Wednesday       Latte          25      5
6    Thursday    Espresso          40      5
7    Thursday       Latte          30      5
8      Friday    Espresso          45      5
9      Friday       Latte          35      5
10   Saturday    Espresso          45      5
11   Saturday       Latte          35      5
12     Sunday    Espresso          45      5
13     Sunday       Latte          35      5

In [63]:
import numpy as np
coffee['new_price']=np.where(coffee['Coffee Type']=='Espresso',4,5)

In [64]:
coffee

          Day Coffee Type  Units Sold  price  new_price
0      Monday    Espresso          25      5          4
1      Monday       Latte          15      5          5
2     Tuesday    Espresso          10      5          4
3     Tuesday       Latte          10      5          5
4   Wednesday    Espresso          10      5          4
5   Wednesday       Latte          25      5          5
6    Thursday    Espresso          40      5          4
7    Thursday       Latte          30      5          5
8      Friday    Espresso          45      5          4
9      Friday       Latte          35      5          5
10   Saturday    Espresso          45      5          4
11   Saturday       Latte          35      5          5
12     Sunday    Espresso          45      5          4
13     Sunday       Latte          35      5          5

In [65]:
coffee.drop(columns=['price'], inplace=True)

In [66]:
coffee

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25          4
1      Monday       Latte          15          5
2     Tuesday    Espresso          10          4
3     Tuesday       Latte          10          5
4   Wednesday    Espresso          10          4
5   Wednesday       Latte          25          5
6    Thursday    Espresso          40          4
7    Thursday       Latte          30          5
8      Friday    Espresso          45          4
9      Friday       Latte          35          5
10   Saturday    Espresso          45          4
11   Saturday       Latte          35          5
12     Sunday    Espresso          45          4
13     Sunday       Latte          35          5

In [67]:
coffee.rename(columns={'new_price':'price'}, inplace=True)

In [68]:
coffee

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25      4
1      Monday       Latte          15      5
2     Tuesday    Espresso          10      4
3     Tuesday       Latte          10      5
4   Wednesday    Espresso          10      4
5   Wednesday       Latte          25      5
6    Thursday    Espresso          40      4
7    Thursday       Latte          30      5
8      Friday    Espresso          45      4
9      Friday       Latte          35      5
10   Saturday    Espresso          45      4
11   Saturday       Latte          35      5
12     Sunday    Espresso          45      4
13     Sunday       Latte          35      5

In [69]:
coffee['revenue']= coffee['Units Sold']*coffee['price']

In [70]:
coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso          25      4      100
1      Monday       Latte          15      5       75
2     Tuesday    Espresso          10      4       40
3     Tuesday       Latte          10      5       50
4   Wednesday    Espresso          10      4       40
5   Wednesday       Latte          25      5      125
6    Thursday    Espresso          40      4      160
7    Thursday       Latte          30      5      150
8      Friday    Espresso          45      4      180
9      Friday       Latte          35      5      175
10   Saturday    Espresso          45      4      180
11   Saturday       Latte          35      5      175
12     Sunday    Espresso          45      4      180
13     Sunday       Latte          35      5      175

In [71]:
bios_new= bios.copy()

In [72]:
bios_new['first_name']=bios_new['name'].str.split(' ').str[0]

In [73]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert

In [74]:
bios_new.query('first_name=="Patrick"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN,Patrick
119,120,Patrick Wheatley,1899-01-20,Vryheid,KwaZulu-Natal,RSA,Great Britain,NaN,NaN,1967-11-05,Patrick
319,320,Patrick De Koning,1961-04-23,Dendermonde,Oost-Vlaanderen,BEL,Belgium,178.0,92.0,NaN,Patrick
2115,2125,Patrick Jopp,1962-01-08,NaN,NaN,NaN,Switzerland,176.0,67.0,NaN,Patrick
2454,2465,Patrick Birocheau,1955-09-23,Béjaïa,Béjaïa,ALG,France,177.0,72.0,NaN,Patrick
...,...,...,...,...,...,...,...,...,...,...,...
143975,147633,Patrick Chinyemba,2001-01-03,NaN,NaN,NaN,Zambia,NaN,NaN,NaN,Patrick
144172,147850,Patrick Jakob,1996-10-17,Sankt Johann in Tirol,Tirol,AUT,Austria,NaN,NaN,NaN,Patrick
144547,148239,Patrick Galbraith,1986-03-11,Haderslev,Syddanmark,DEN,Denmark,NaN,NaN,NaN,Patrick
144565,148257,Patrick Russell,1993-01-04,Gentofte,Hovedstaden,DEN,Denmark,186.0,93.0,NaN,Patrick
145435,149158,Patrick Gasienica,1998-11-28,McHenry,Illinois,USA,United States,NaN,NaN,2023-06-12,Patrick

In [75]:
bios_new['born_datetime']=pd.to_datetime(bios_new['born_date'])

In [76]:
bios_new['born_year']=bios_new['born_datetime'].dt.year

In [77]:
bios_new[['name','born_year']]

                         name  born_year
0       Jean-François Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         André Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

In [78]:
bios_new.to_csv('./data/bios_new.csv', index= False)

In [79]:
bios['height_category']=bios['height_cm'].apply(lambda x: 'short' if x < 165 else('average' if x < 185 else 'tall'))

In [80]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,tall

In [81]:
def categorize_athlete(row):
    if row['height_cm'] < 175 and row['weight_kg'] <70 :
        return'Lightweight'
    elif row['height_cm']< 185 and row['weight_kg'] <=80:
        return 'Middleweight'
    else:
        return 'Heavyweight'

bios['category'] = bios.apply(categorize_athlete, axis=1)

In [82]:

bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,tall,Heavyweight

In [83]:
bios.head(39)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,tall,Heavyweight
5,6,Nicolas Chatelain,1970-01-13,Amiens,Somme,FRA,France,181.0,70.0,NaN,average,Middleweight
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN,average,Middleweight
7,8,Henri Cochet,1901-12-14,Villeurbanne,Rhône,FRA,France,NaN,NaN,1987-04-02,tall,Heavyweight
8,9,Marcel Cousin,1896-08-04,Nîmes,Gard,FRA,France,NaN,NaN,1986-08-01,tall,Heavyweight
9,10,Guy de la Chapelle,1868-07-16,Farges-Allichamps,Cher,FRA,France,NaN,NaN,1923-08-27,tall,Heavyweight
10,11,"Élie, Comte de Lastours",1874-08-12,Orgeval,Yvelines,FRA,France,NaN,NaN,1932-11-18,tall,Heavyweight
11,12,Max Decugis,1882-09-24,Paris XVIe,Paris,FRA,France,NaN,NaN,1978-09-06,tall,Heavyweight
12,13,J. Defert,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,tall,Heavyweight
13,14,Étienne Durand,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,tall,Heavyweight
14,15,Damien Éloi,1969-07-04,Vire,Calvados,FRA,France,165.0,58.0,NaN,average,Lightweight
15,16,Adrien Fauchier-Magnan,1873-11-19,Paris VIIIe,Paris,FRA,France,NaN,NaN,1965-08-06,tall,Heavyweight
16,17,Guy Forget,1965-01-04,Casablanca,Casablanca-Settat,MAR,France,189.0,79.0,NaN,tall,Heavyweight
17,18,Jean-Philippe Gatien,1968-10-16,Alès,Gard,FRA,France,178.0,73.0,NaN,average,Middleweight
18,19,Maurice Germot,1882-11-15,Vichy,Allier,FRA,France,NaN,NaN,1958-08-06,tall,Heavyweight
19,20,André Gobert,1890-09-30,Paris XVIIe,Paris,FRA,France,NaN,NaN,1951-12-06,tall,Heavyweight
20,21,Pierre Hirsch,1900-11-08,Paris Ie,Paris,FRA,France,NaN,NaN,1942-04-19,tall,Heavyweight
21,22,René Lacoste,1904-07-02,Paris Xe,Paris,FRA,France,NaN,NaN,1996-10-12,tall,Heavyweight
22,23,Daniel Lawton,1881-11-27,Cantenac,Gironde,FRA,France,NaN,NaN,1979-03-27,tall,Heavyweight
23,24,Paul Lebreton,1875-10-19,Paris IIe,Paris,FRA,France,NaN,NaN,1960-03-31,tall,Heavyweight
24,25,Paul Lecaron,1863-07-29,Neuilly-sur-Seine,Hauts-de-Seine,FRA,France,NaN,NaN,1940-09-17,tall,Heavyweight
25,26,Henri Leconte,1963-07-04,Lillers,Pas-de-Calais,FRA,France,184.0,78.0,NaN,average,Middleweight
26,27,Christophe Legoût,1973-08-06,Montbéliard,Doubs,FRA,France,177.0,75.0,NaN,average,Middleweight
27,28,"Guy, Baron Lejeune",NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,tall,Heavyweight
28,29,Albert Lippmann,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,tall,Heavyweight
29,30,Édouard Mény de Marangue,1882-11-30,Paris VIe,Paris,FRA,France,NaN,NaN,1960-01-23,tall,Heavyweight
30,31,André Prévost,1875-02-28,Paris VIIIe,Paris,FRA,France,NaN,NaN,1951-11-22,tall,Heavyweight
31,32,Guillaume Raoux,1970-02-14,Bagnols-sur-Cèze,Gard,FRA,France,180.0,77.0,NaN,average,Middleweight
32,33,Stéphane Renault,1968-03-01,Barfleur,Manche,FRA,France,180.0,72.0,NaN,average,Middleweight
33,34,Jean-Pierre Samazeuilh,1891-01-17,Bordeaux,Gironde,FRA,France,NaN,NaN,1965-04-13,tall,Heavyweight
34,35,Fabrice Santoro,1972-12-09,Tahiti,Îles du Vent,FPN,France,177.0,68.0,NaN,average,Middleweight
35,36,Étienne Thobois,1967-09-20,Amiens,Somme,FRA,France,186.0,78.0,NaN,tall,Heavyweight
36,37,Pierre Verdé-Delisle,1877-05-16,Trie-la-Ville,Oise,FRA,France,NaN,NaN,1960-07-18,tall,Heavyweight
37,38,Helen Aitchison,1881-12-06,Sunderland,England,GBR,Great Britain,NaN,NaN,1947-05-26,tall,Heavyweight
38,39,Geraldine Beamish,1883-06-23,Forest Gate,England,GBR,Great Britain,NaN,NaN,1972-05-10,tall,Heavyweight

In [84]:
noc_regions.head(16)

    NOC          region                 notes
0   AFG     Afghanistan                   NaN
1   AHO         Curacao  Netherlands Antilles
2   ALB         Albania                   NaN
3   ALG         Algeria                   NaN
4   AND         Andorra                   NaN
5   ANG          Angola                   NaN
6   ANT         Antigua   Antigua and Barbuda
7   ANZ       Australia           Australasia
8   ARG       Argentina                   NaN
9   ARM         Armenia                   NaN
10  ARU           Aruba                   NaN
11  ASA  American Samoa                   NaN
12  AUS       Australia                   NaN
13  AUT         Austria                   NaN
14  AZE      Azerbaijan                   NaN
15  BAH         Bahamas                   NaN

In [145]:
noc_regions['notes'].isnull().sum()

np.int64(209)

In [146]:
noc_regions.fillna('NO notes')

     NOC       region                 notes
0    AFG  Afghanistan              NO notes
1    AHO      Curacao  Netherlands Antilles
2    ALB      Albania              NO notes
3    ALG      Algeria              NO notes
4    AND      Andorra              NO notes
..   ...          ...                   ...
225  YEM        Yemen              NO notes
226  YMD        Yemen           South Yemen
227  YUG       Serbia            Yugoslavia
228  ZAM       Zambia              NO notes
229  ZIM     Zimbabwe              NO notes

[230 rows x 3 columns]

In [85]:
nocs=pd.read_csv('./data/noc_regions.csv')
bios_new=pd.merge(bios, nocs, left_on='born_country', right_on='NOC',how='left')

In [86]:
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,category,NOC_y,region,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,tall,Heavyweight,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average,Middleweight,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average,Middleweight,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,average,Lightweight,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,tall,Heavyweight,GBR,UK,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,average,Lightweight,RUS,Russia,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,average,Lightweight,RUS,Russia,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,short,Lightweight,RUS,Russia,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,average,Heavyweight,FRA,France,NaN
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,tall,Heavyweight,AUS,Australia,NaN

In [87]:
usa= bios[bios['born_country']=='USA'].copy()
gbr= bios[bios['born_country']=='GBR'].copy()

In [88]:
new_df=pd.concat([usa,gbr])

In [89]:
new_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN,average,Middleweight
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN,average,Lightweight
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN,short,Lightweight
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20,tall,Heavyweight
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN,average,Lightweight

In [90]:
new_df.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category
144811,148512,Benjamin Alexander,1983-05-08,London,England,GBR,Jamaica,NaN,NaN,NaN,tall,Heavyweight
144815,148517,Ashley Watson,1993-10-28,Peterborough,England,GBR,Jamaica,NaN,NaN,NaN,tall,Heavyweight
145005,148716,Peder Kongshaug,2001-08-13,Wimbledon,England,GBR,Norway,184.0,86.0,NaN,average,Heavyweight
145319,149041,Axel Brown,1992-04-02,Harrogate,England,GBR,Trinidad and Tobago,NaN,NaN,NaN,tall,Heavyweight
145388,149111,Jean-Luc Baker,1993-10-07,Burnley,England,GBR,United States,NaN,NaN,NaN,tall,Heavyweight

In [91]:
coffee.loc[[2,3],'Units Sold'] = np.nan

In [92]:
coffee= pd.read_csv('./warmup-data/coffee.csv')

In [93]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [139]:
coffee.loc[[2,3],'Units Sold'] =np.nan

In [136]:
coffee

,Day,Coffee Type,Units Sold,Price,revenue,yesterday_revenue,pct_change
0,Monday,Espresso,25.0,5,125.000000,NaN,NaN
1,Monday,Latte,15.0,6,90.000000,NaN,NaN
2,Tuesday,Espresso,NaN,5,170.833333,125.000000,136.666667
3,Tuesday,Latte,NaN,6,205.000000,90.000000,227.777778
4,Wednesday,Espresso,35.0,5,175.000000,170.833333,102.439024
5,Wednesday,Latte,25.0,6,150.000000,205.000000,73.170732
6,Thursday,Espresso,40.0,5,200.000000,175.000000,114.285714
7,Thursday,Latte,30.0,6,180.000000,150.000000,120.000000
8,Friday,Espresso,45.0,5,225.000000,200.000000,112.500000
9,Friday,Latte,35.0,6,210.000000,180.000000,116.666667
10,Saturday,Espresso,45.0,5,225.000000,225.000000,100.000000
11,Saturday,Latte,35.0,6,210.000000,210.000000,100.000000
12,Sunday,Espresso,45.0,5,225.000000,225.000000,100.000000
13,Sunday,Latte,35.0,6,210.000000,210.000000,100.000000

In [ ]:
coffee.dropna(subset=['Units Sold'])

,Day,Coffee Type,Units Sold,Price,revenue,yesterday_revenue,pct_change
0,Monday,Espresso,25.0,5,125.0,NaN,NaN
1,Monday,Latte,15.0,6,90.0,NaN,NaN
4,Wednesday,Espresso,35.0,5,175.0,170.833333,102.439024
5,Wednesday,Latte,25.0,6,150.0,205.000000,73.170732
6,Thursday,Espresso,40.0,5,200.0,175.000000,114.285714
7,Thursday,Latte,30.0,6,180.0,150.000000,120.000000
8,Friday,Espresso,45.0,5,225.0,200.000000,112.500000
9,Friday,Latte,35.0,6,210.0,180.000000,116.666667
10,Saturday,Espresso,45.0,5,225.0,225.000000,100.000000
11,Saturday,Latte,35.0,6,210.0,210.000000,100.000000
12,Sunday,Espresso,45.0,5,225.0,225.000000,100.000000
13,Sunday,Latte,35.0,6,210.0,210.000000,100.000000

In [96]:
coffee['Units Sold'].fillna(coffee['Units Sold'].mean(), inplace= True)

C:\Users\rakib\AppData\Local\Temp\ipykernel_18416\1163417235.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  coffee['Units Sold'].fillna(coffee['Units Sold'].mean(), inplace= True)

In [140]:
coffee

,Day,Coffee Type,Units Sold,Price,revenue,yesterday_revenue,pct_change
0,Monday,Espresso,25.0,5,125.000000,NaN,NaN
1,Monday,Latte,15.0,6,90.000000,NaN,NaN
2,Tuesday,Espresso,NaN,5,170.833333,125.000000,136.666667
3,Tuesday,Latte,NaN,6,205.000000,90.000000,227.777778
4,Wednesday,Espresso,35.0,5,175.000000,170.833333,102.439024
5,Wednesday,Latte,25.0,6,150.000000,205.000000,73.170732
6,Thursday,Espresso,40.0,5,200.000000,175.000000,114.285714
7,Thursday,Latte,30.0,6,180.000000,150.000000,120.000000
8,Friday,Espresso,45.0,5,225.000000,200.000000,112.500000
9,Friday,Latte,35.0,6,210.000000,180.000000,116.666667
10,Saturday,Espresso,45.0,5,225.000000,225.000000,100.000000
11,Saturday,Latte,35.0,6,210.000000,210.000000,100.000000
12,Sunday,Espresso,45.0,5,225.000000,225.000000,100.000000
13,Sunday,Latte,35.0,6,210.000000,210.000000,100.000000

In [98]:
coffee['Price']=np.where(coffee['Coffee Type']=='Espresso',5,6)

In [99]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso   25.000000      5
1      Monday       Latte   15.000000      6
2     Tuesday    Espresso   34.166667      5
3     Tuesday       Latte   34.166667      6
4   Wednesday    Espresso   35.000000      5
5   Wednesday       Latte   25.000000      6
6    Thursday    Espresso   40.000000      5
7    Thursday       Latte   30.000000      6
8      Friday    Espresso   45.000000      5
9      Friday       Latte   35.000000      6
10   Saturday    Espresso   45.000000      5
11   Saturday       Latte   35.000000      6
12     Sunday    Espresso   45.000000      5
13     Sunday       Latte   35.000000      6

In [100]:
coffee.dropna(subset=['Units Sold'])

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso   25.000000      5
1      Monday       Latte   15.000000      6
2     Tuesday    Espresso   34.166667      5
3     Tuesday       Latte   34.166667      6
4   Wednesday    Espresso   35.000000      5
5   Wednesday       Latte   25.000000      6
6    Thursday    Espresso   40.000000      5
7    Thursday       Latte   30.000000      6
8      Friday    Espresso   45.000000      5
9      Friday       Latte   35.000000      6
10   Saturday    Espresso   45.000000      5
11   Saturday       Latte   35.000000      6
12     Sunday    Espresso   45.000000      5
13     Sunday       Latte   35.000000      6

In [101]:
bios['name'].fillna('Unknown',inplace=True)

C:\Users\rakib\AppData\Local\Temp\ipykernel_18416\1913398038.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  bios['name'].fillna('Unknown',inplace=True)

In [141]:
coffee[coffee['Units Sold'].notna()]

,Day,Coffee Type,Units Sold,Price,revenue,yesterday_revenue,pct_change
0,Monday,Espresso,25.0,5,125.0,NaN,NaN
1,Monday,Latte,15.0,6,90.0,NaN,NaN
4,Wednesday,Espresso,35.0,5,175.0,170.833333,102.439024
5,Wednesday,Latte,25.0,6,150.0,205.000000,73.170732
6,Thursday,Espresso,40.0,5,200.0,175.000000,114.285714
7,Thursday,Latte,30.0,6,180.0,150.000000,120.000000
8,Friday,Espresso,45.0,5,225.0,200.000000,112.500000
9,Friday,Latte,35.0,6,210.0,180.000000,116.666667
10,Saturday,Espresso,45.0,5,225.0,225.000000,100.000000
11,Saturday,Latte,35.0,6,210.0,210.000000,100.000000
12,Sunday,Espresso,45.0,5,225.0,225.000000,100.000000
13,Sunday,Latte,35.0,6,210.0,210.000000,100.000000

Aggregating Data

In [103]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,tall,Heavyweight

In [104]:
bios['born_city'].value_counts()

born_city
Budapest            1378
Moskva (Moscow)      883
Oslo                 708
Stockholm            629
Praha (Prague)       600
                    ...
Roth                   1
Romoos                 1
Dva Polya Artash       1
Dulwich Hill           1
Visé                   1
Name: count, Length: 22368, dtype: int64

In [105]:
bios[bios['born_country']=='USA']['born_region'].value_counts()

born_region
California              1634
New York                 990
Illinois                 585
Massachusetts            530
Pennsylvania             530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawaiʻi                   95
Kansas                    94
Oklahoma                  93
Louisiana                 92
Utah                      91
Missouri                  91
North Carolina            86
Arizona                   83
New Hampshire             83
Vermont                   68
Mississippi               66
Alabama                   64
Kentucky                  62
Tennessee                 62
Nebraska                  60
Rhode Island              56
Montana                   55
Maine                     50
South Carolina            50
Alaska                    45
Arkansas                  42
Idaho                     41
New Mexico                38
Nevada                    36
South Dakota              27
West Virginia             24
Delaware                  22
North Dakota              16
Wyoming                   14
Name: count, dtype: int64

In [106]:
bios[bios['born_country']=='USA']['born_city'].value_counts().tail(19)

born_city
Milpitas          1
Chesterfield      1
American Fork     1
Bowlegs           1
Apopka            1
Huntersville      1
Monroeville       1
Sugar Land        1
Pembroke Pines    1
Conyers           1
Richardson        1
Duanesburg        1
Southlake         1
Salina            1
Tualatin          1
Old Saybrook      1
Haleiwa           1
Allen Park        1
Lakeville         1
Name: count, dtype: int64

In [107]:
coffee.groupby(['Coffee Type'])['Units Sold'].sum()

Coffee Type
Espresso    269.166667
Latte       209.166667
Name: Units Sold, dtype: float64

In [108]:
coffee.groupby(['Coffee Type'])['Units Sold'].mean()

Coffee Type
Espresso    38.452381
Latte       29.880952
Name: Units Sold, dtype: float64

In [109]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso   25.000000      5
1      Monday       Latte   15.000000      6
2     Tuesday    Espresso   34.166667      5
3     Tuesday       Latte   34.166667      6
4   Wednesday    Espresso   35.000000      5
5   Wednesday       Latte   25.000000      6
6    Thursday    Espresso   40.000000      5
7    Thursday       Latte   30.000000      6
8      Friday    Espresso   45.000000      5
9      Friday       Latte   35.000000      6
10   Saturday    Espresso   45.000000      5
11   Saturday       Latte   35.000000      6
12     Sunday    Espresso   45.000000      5
13     Sunday       Latte   35.000000      6

In [110]:
coffee.groupby(['Coffee Type', 'Day']).agg({'Units Sold':'sum', 'Price':'mean'})

                       Units Sold  Price
Coffee Type Day
Espresso    Friday      45.000000    5.0
            Monday      25.000000    5.0
            Saturday    45.000000    5.0
            Sunday      45.000000    5.0
            Thursday    40.000000    5.0
            Tuesday     34.166667    5.0
            Wednesday   35.000000    5.0
Latte       Friday      35.000000    6.0
            Monday      15.000000    6.0
            Saturday    35.000000    6.0
            Sunday      35.000000    6.0
            Thursday    30.000000    6.0
            Tuesday     34.166667    6.0
            Wednesday   25.000000    6.0

In [111]:
coffee['revenue']= coffee['Price']* coffee['Units Sold']

In [112]:
coffee

          Day Coffee Type  Units Sold  Price     revenue
0      Monday    Espresso   25.000000      5  125.000000
1      Monday       Latte   15.000000      6   90.000000
2     Tuesday    Espresso   34.166667      5  170.833333
3     Tuesday       Latte   34.166667      6  205.000000
4   Wednesday    Espresso   35.000000      5  175.000000
5   Wednesday       Latte   25.000000      6  150.000000
6    Thursday    Espresso   40.000000      5  200.000000
7    Thursday       Latte   30.000000      6  180.000000
8      Friday    Espresso   45.000000      5  225.000000
9      Friday       Latte   35.000000      6  210.000000
10   Saturday    Espresso   45.000000      5  225.000000
11   Saturday       Latte   35.000000      6  210.000000
12     Sunday    Espresso   45.000000      5  225.000000
13     Sunday       Latte   35.000000      6  210.000000

In [113]:
pivot = coffee.pivot (columns= 'Coffee Type', index= 'Day', values='revenue')

In [114]:
print(pivot)

Coffee Type    Espresso  Latte
Day
Friday       225.000000  210.0
Monday       125.000000   90.0
Saturday     225.000000  210.0
Sunday       225.000000  210.0
Thursday     200.000000  180.0
Tuesday      170.833333  205.0
Wednesday    175.000000  150.0

In [115]:
pivot.sum()

Coffee Type
Espresso    1345.833333
Latte       1255.000000
dtype: float64

In [144]:
pivot.sum(axis=1)

Day
Friday       435.000000
Monday       215.000000
Saturday     435.000000
Sunday       435.000000
Thursday     380.000000
Tuesday      375.833333
Wednesday    325.000000
dtype: float64

In [117]:
bios['born_date'] = pd.to_datetime(bios['born_date'])
bios['born_year'] =bios['born_date'].dt.year
bios['born_month'] = bios['born_date'].dt.month
bios.groupby([bios['born_year'], bios['born_month']])['name'].count().reset_index().sort_values('name',ascending=False)

      born_year  born_month  name
1437     1970.0         1.0   239
1461     1972.0         1.0   229
1629     1986.0         1.0   227
1497     1975.0         1.0   227
1617     1985.0         1.0   225
...         ...         ...   ...
51       1852.0         5.0     1
52       1852.0         6.0     1
1882     2008.0         7.0     1
1883     2008.0         8.0     1
1884     2009.0         1.0     1

[1885 rows x 3 columns]

In [118]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category,born_year,born_month
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,tall,Heavyweight,1886.0,12.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average,Middleweight,1969.0,4.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average,Middleweight,1898.0,8.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,average,Lightweight,1895.0,5.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,tall,Heavyweight,1878.0,4.0

Advanced functionality-----shift() rank() cumsum() rolling()

In [119]:
coffee['yesterday_revenue'] = coffee['revenue'].shift(2)

In [120]:
coffee

          Day Coffee Type  Units Sold  Price     revenue  yesterday_revenue
0      Monday    Espresso   25.000000      5  125.000000                NaN
1      Monday       Latte   15.000000      6   90.000000                NaN
2     Tuesday    Espresso   34.166667      5  170.833333         125.000000
3     Tuesday       Latte   34.166667      6  205.000000          90.000000
4   Wednesday    Espresso   35.000000      5  175.000000         170.833333
5   Wednesday       Latte   25.000000      6  150.000000         205.000000
6    Thursday    Espresso   40.000000      5  200.000000         175.000000
7    Thursday       Latte   30.000000      6  180.000000         150.000000
8      Friday    Espresso   45.000000      5  225.000000         200.000000
9      Friday       Latte   35.000000      6  210.000000         180.000000
10   Saturday    Espresso   45.000000      5  225.000000         225.000000
11   Saturday       Latte   35.000000      6  210.000000         210.000000
12     Sunday    Espresso   45.000000      5  225.000000         225.000000
13     Sunday       Latte   35.000000      6  210.000000         210.000000

In [121]:
coffee['pct_change'] = coffee['revenue'] / coffee['yesterday_revenue']*100

In [122]:
coffee

,Day,Coffee Type,Units Sold,Price,revenue,yesterday_revenue,pct_change
0,Monday,Espresso,25.000000,5,125.000000,NaN,NaN
1,Monday,Latte,15.000000,6,90.000000,NaN,NaN
2,Tuesday,Espresso,34.166667,5,170.833333,125.000000,136.666667
3,Tuesday,Latte,34.166667,6,205.000000,90.000000,227.777778
4,Wednesday,Espresso,35.000000,5,175.000000,170.833333,102.439024
5,Wednesday,Latte,25.000000,6,150.000000,205.000000,73.170732
6,Thursday,Espresso,40.000000,5,200.000000,175.000000,114.285714
7,Thursday,Latte,30.000000,6,180.000000,150.000000,120.000000
8,Friday,Espresso,45.000000,5,225.000000,200.000000,112.500000
9,Friday,Latte,35.000000,6,210.000000,180.000000,116.666667
10,Saturday,Espresso,45.000000,5,225.000000,225.000000,100.000000
11,Saturday,Latte,35.000000,6,210.000000,210.000000,100.000000
12,Sunday,Espresso,45.000000,5,225.000000,225.000000,100.000000
13,Sunday,Latte,35.000000,6,210.000000,210.000000,100.000000

In [123]:
bios['height_rank']  = bios['height_cm'].rank(ascending=False)

In [124]:
bios[['name','height_cm','height_rank','born_country']].sort_values('height_rank')

                         name  height_cm  height_rank born_country
89070                Yao Ming      226.0          1.0          CHN
6978          Arvydas Sabonis      223.0          2.5          LTU
5781           Tommy Burleson      223.0          2.5          USA
5673           Gunther Behnke      221.0          5.0          GER
89075          Roberto Dueñas      221.0          5.0          ESP
...                       ...        ...          ...          ...
145490            Sin Ye-Chan        NaN          NaN          NaN
145491          Matthew Wepke        NaN          NaN          NaN
145492  Carlos García-Ordóñez        NaN          NaN          CUB
145493     Landysh Falyakhova        NaN          NaN          RUS
145499          Bill Phillips        NaN          NaN          AUS

[145500 rows x 4 columns]

In [125]:
pd.__version__

'2.3.2'

In [126]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category,born_year,born_month,height_rank
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,tall,Heavyweight,1886.0,12.0,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average,Middleweight,1969.0,4.0,27597.5
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average,Middleweight,1898.0,8.0,27597.5
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,average,Lightweight,1895.0,5.0,83975.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,tall,Heavyweight,1878.0,4.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,average,Lightweight,2002.0,1.0,87188.5
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,average,Lightweight,1999.0,9.0,83975.0
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,short,Lightweight,1998.0,5.0,96305.5
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,average,Heavyweight,1899.0,5.0,89274.5
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,tall,Heavyweight,1913.0,7.0,NaN

In [127]:
bios[(bios['born_city'].str.lower() == 'california') | (bios['born_region'].str.lower() == 'san francisco')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category,born_year,born_month,height_rank
78008,78599,Frank Jarvis,1878-08-31,California,Pennsylvania,USA,United States,167.0,58.0,1933-06-02,average,Lightweight,1878.0,8.0,87188.5
119901,121743,Andrew Rutherfurd,1988-12-21,California,Pennsylvania,USA,Bolivia,178.0,80.0,NaN,average,Middleweight,1988.0,12.0,46966.0